{"backend": "tensorflow", "keras_version": "2.1.4", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": true, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [5, 5], "filters": 30, "batch_input_shape": [null, 1, 28, 28], "padding": "valid", "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "data_format": "channels_first", "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [3, 3], "filters": 15, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 128, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "dense_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 50, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "dense_2"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "dense_3"}}]}